In [1]:
import pandas as pd

In [2]:
df_data = pd.read_csv('supermarket_sales.csv')

In [3]:
df_data.head()

,Invoice ID,Branch,City,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,cogs,gross margin percentage,gross income,Rating
0,750-67-8428,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,1/5/2019,13:08,Ewallet,522.83,4.761905,26.1415,9.1
1,226-31-3081,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,76.40,4.761905,3.8200,9.6
2,631-41-3108,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,324.31,4.761905,16.2155,7.4
3,123-19-1176,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,1/27/2019,20:33,Ewallet,465.76,4.761905,23.2880,8.4
4,373-73-7910,A,Yangon,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,604.17,4.761905,30.2085,5.3

In [4]:
#Qual o faturamento total da filial?
df_data.groupby('City')[['Total', 'gross income']].sum()

                 Total  gross income
City
Mandalay   106197.6720     5057.0320
Naypyitaw  110568.7065     5265.1765
Yangon     106200.3705     5057.1605

In [5]:
#Qual a percentual de participação na receita de cada tipo de produto?
(df_data.groupby('Product line')['Total'].sum() / df_data.groupby('Product line')['Total'].sum().sum()).sort_values() * 100

Product line
Health and beauty         15.231828
Home and lifestyle        16.677232
Fashion accessories       16.814702
Electronic accessories    16.824497
Sports and travel         17.067648
Food and beverages        17.384094
Name: Total, dtype: float64

In [6]:
#Como está distribuído o tipo de produto consumido por gênero
df_data.groupby(['Product line', 'Gender'])[['Total']].sum().pivot_table(index='Product line', columns='Gender')

                             Total
Gender                      Female        Male
Product line
Electronic accessories  27102.0225  27235.5090
Fashion accessories     30437.4000  23868.4950
Food and beverages      33170.9175  22973.9265
Health and beauty       18560.9865  30632.7525
Home and lifestyle      30036.8775  23825.0355
Sports and travel       28574.7210  26548.1055

In [7]:
#Qual foi o faturamento por mês?
df_data['Date'] = pd.to_datetime(df_data['Date'])
df_data['Month'] = df_data['Date'].apply(lambda x: x.month)
df_data['Year'] = df_data['Date'].apply(lambda x: x.year)
df_data.groupby(['Month'])['Total'].sum()

Month
1    116291.868
2     97219.374
3    109455.507
Name: Total, dtype: float64

In [8]:
#Qual foi a média de avaliação por cada filial em janeiro de 2019
df_data[(df_data['Year'] == 2019) & (df_data['Month'] == 1)]['Rating'].mean()

np.float64(7.017613636363635)

In [9]:
#Como se distribui o gasto por tipo de consumidor em cada filial
df_data.groupby(['Customer type', 'City'])['Total'].sum()

Customer type  City
Member         Mandalay     53704.6860
               Naypyitaw    56881.2825
               Yangon       53637.4755
Normal         Mandalay     52492.9860
               Naypyitaw    53687.4240
               Yangon       52562.8950
Name: Total, dtype: float64

In [10]:
import numpy as np

In [11]:
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [13]:
pd.Series(data=labels, index=minha_lista) #Poderia ter feito pd.Series(labels, minha_lista) que daria o mesmo resultado

10    a
20    b
30    c
dtype: object

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
ser1 = pd.Series([1,2,3,4],index=['EUA', 'Alemanha', 'Russia', 'Japão'])

In [16]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [17]:
ser2 = pd.Series([1,2,5,4],index=['EUA', 'Alemanha', 'Italia', 'Japão'])
ser2

EUA         1
Alemanha    2
Italia      5
Japão       4
dtype: int64

In [18]:
ser1['EUA']

np.int64(1)

In [19]:
ser1[['Alemanha','Russia']]

Alemanha    2
Russia      3
dtype: int64

In [20]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
Russia      NaN
dtype: float64

###DataFrames

In [21]:
from numpy.random import randn

In [22]:
df = pd.DataFrame(randn(5,4), index=['A',"B",'C','D','E'], columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.124021  0.793249  0.851774  0.750153
B -0.163952  0.607974  0.427900 -0.599435
C -0.983804 -1.209122 -0.928606  0.117670
D -1.503764  0.309906  1.003632  0.222567
E -0.333353 -0.535648  0.496477  0.144530

In [23]:
df['W']

A   -1.124021
B   -0.163952
C   -0.983804
D   -1.503764
E   -0.333353
Name: W, dtype: float64

In [24]:
df[['W']]

          W
A -1.124021
B -0.163952
C -0.983804
D -1.503764
E -0.333353

In [25]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.124021  0.793249  0.851774  0.750153 -0.272247
B -0.163952  0.607974  0.427900 -0.599435  0.263948
C -0.983804 -1.209122 -0.928606  0.117670 -1.912409
D -1.503764  0.309906  1.003632  0.222567 -0.500132
E -0.333353 -0.535648  0.496477  0.144530  0.163124

In [26]:
df.drop('new', axis=1) #ais = 1 corresponde a colunas e axis =0 linhas

          W         X         Y         Z
A -1.124021  0.793249  0.851774  0.750153
B -0.163952  0.607974  0.427900 -0.599435
C -0.983804 -1.209122 -0.928606  0.117670
D -1.503764  0.309906  1.003632  0.222567
E -0.333353 -0.535648  0.496477  0.144530

In [27]:
df

          W         X         Y         Z       new
A -1.124021  0.793249  0.851774  0.750153 -0.272247
B -0.163952  0.607974  0.427900 -0.599435  0.263948
C -0.983804 -1.209122 -0.928606  0.117670 -1.912409
D -1.503764  0.309906  1.003632  0.222567 -0.500132
E -0.333353 -0.535648  0.496477  0.144530  0.163124

In [28]:
df.drop('new', axis=1, inplace=True) #retira a coluna new do arquivo original

In [29]:
df

          W         X         Y         Z
A -1.124021  0.793249  0.851774  0.750153
B -0.163952  0.607974  0.427900 -0.599435
C -0.983804 -1.209122 -0.928606  0.117670
D -1.503764  0.309906  1.003632  0.222567
E -0.333353 -0.535648  0.496477  0.144530

In [30]:
df.loc['A']

W   -1.124021
X    0.793249
Y    0.851774
Z    0.750153
Name: A, dtype: float64

In [31]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -1.124021  0.793249  0.851774  0.750153
B -0.163952  0.607974  0.427900 -0.599435

In [32]:
df.iloc[0,2] #primeiro valor será a linha e o segundo a coluna para acessar uma célula da tabela

np.float64(0.8517744411250352)

In [33]:
df.iloc[:-1, :]

          W         X         Y         Z
A -1.124021  0.793249  0.851774  0.750153
B -0.163952  0.607974  0.427900 -0.599435
C -0.983804 -1.209122 -0.928606  0.117670
D -1.503764  0.309906  1.003632  0.222567

In [34]:
df.iloc[1:4, 1:3]

          X         Y
B  0.607974  0.427900
C -1.209122 -0.928606
D  0.309906  1.003632

In [35]:
df + df

          W         X         Y         Z
A -2.248043  1.586498  1.703549  1.500305
B -0.327904  1.215948  0.855800 -1.198869
C -1.967607 -2.418245 -1.857211  0.235339
D -3.007527  0.619812  2.007264  0.445135
E -0.666706 -1.071297  0.992954  0.289061

In [36]:
df > 0

       W      X      Y      Z
A  False   True   True   True
B  False   True   True  False
C  False  False  False   True
D  False   True   True   True
E  False  False   True   True

In [37]:
df[df > 0]

    W         X         Y         Z
A NaN  0.793249  0.851774  0.750153
B NaN  0.607974  0.427900       NaN
C NaN       NaN       NaN  0.117670
D NaN  0.309906  1.003632  0.222567
E NaN       NaN  0.496477  0.144530

In [38]:
df['Y'] > 0

A     True
B     True
C    False
D     True
E     True
Name: Y, dtype: bool

In [39]:
df[df['X'] > 0]

          W         X         Y         Z
A -1.124021  0.793249  0.851774  0.750153
B -0.163952  0.607974  0.427900 -0.599435
D -1.503764  0.309906  1.003632  0.222567

In [40]:
df[(df['X'] > 0) & (df['W'] > 0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [41]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [42]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [43]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.124021  0.793249  0.851774  0.750153
1     B -0.163952  0.607974  0.427900 -0.599435
2     C -0.983804 -1.209122 -0.928606  0.117670
3     D -1.503764  0.309906  1.003632  0.222567
4     E -0.333353 -0.535648  0.496477  0.144530

In [44]:
df

          W         X         Y         Z
A -1.124021  0.793249  0.851774  0.750153
B -0.163952  0.607974  0.427900 -0.599435
C -0.983804 -1.209122 -0.928606  0.117670
D -1.503764  0.309906  1.003632  0.222567
E -0.333353 -0.535648  0.496477  0.144530

In [45]:
df.reset_index(inplace=True)
df

  index         W         X         Y         Z
0     A -1.124021  0.793249  0.851774  0.750153
1     B -0.163952  0.607974  0.427900 -0.599435
2     C -0.983804 -1.209122 -0.928606  0.117670
3     D -1.503764  0.309906  1.003632  0.222567
4     E -0.333353 -0.535648  0.496477  0.144530

In [46]:
df.set_index("index", inplace=True)
df

              W         X         Y         Z
index
A     -1.124021  0.793249  0.851774  0.750153
B     -0.163952  0.607974  0.427900 -0.599435
C     -0.983804 -1.209122 -0.928606  0.117670
D     -1.503764  0.309906  1.003632  0.222567
E     -0.333353 -0.535648  0.496477  0.144530

In [47]:
novoind = 'CA NY WY OR CO'.split()
novoind

['CA', 'NY', 'WY', 'OR', 'CO']

In [48]:
df['novo_index'] = novoind
df

              W         X         Y         Z novo_index
index
A     -1.124021  0.793249  0.851774  0.750153         CA
B     -0.163952  0.607974  0.427900 -0.599435         NY
C     -0.983804 -1.209122 -0.928606  0.117670         WY
D     -1.503764  0.309906  1.003632  0.222567         OR
E     -0.333353 -0.535648  0.496477  0.144530         CO

In [49]:
df.set_index('novo_index')
df

              W         X         Y         Z novo_index
index
A     -1.124021  0.793249  0.851774  0.750153         CA
B     -0.163952  0.607974  0.427900 -0.599435         NY
C     -0.983804 -1.209122 -0.928606  0.117670         WY
D     -1.503764  0.309906  1.003632  0.222567         OR
E     -0.333353 -0.535648  0.496477  0.144530         CO

###Índices multiníveis

In [50]:
#Níveis de Índices 
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

In [51]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [52]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A','B']) #6 linhas e 2 colunas
df

             A         B
G1 1  0.724898 -0.623784
   2 -1.004098  0.321869
   3 -0.613163  0.735802
G2 1 -0.251534 -0.057271
   2  0.559752 -2.086748
   3 -0.840849  1.038602

In [54]:
df.loc['G1']

          A         B
1  0.724898 -0.623784
2 -1.004098  0.321869
3 -0.613163  0.735802

In [55]:
df.loc['G1'].loc[1]

A    0.724898
B   -0.623784
Name: 1, dtype: float64

In [56]:
df.index.names = ['Grupo', 'Número']
df

                     A         B
Grupo Número
G1    1       0.724898 -0.623784
      2      -1.004098  0.321869
      3      -0.613163  0.735802
G2    1      -0.251534 -0.057271
      2       0.559752 -2.086748
      3      -0.840849  1.038602

In [57]:
df.xs('G1')

               A         B
Número
1       0.724898 -0.623784
2      -1.004098  0.321869
3      -0.613163  0.735802

In [58]:
df.xs(1, level='Número')

              A         B
Grupo
G1     0.724898 -0.623784
G2    -0.251534 -0.057271

###Tratamento de dados ausêntes

In [59]:
df_1 = pd.DataFrame({
    'A': [1,2,np.nan],
    'B': [5,np.nan, np.nan],
    'C': [1,2,3]
})
df_1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [60]:
df_1.dropna(axis=0) #Corte dos dados nan nas linhas -> axis = 0

     A    B  C
0  1.0  5.0  1

In [61]:
df_1.dropna(axis=1) #Corte dos dados nan nas colunas -> axis =1

   C
0  1
1  2
2  3

In [62]:
df_1.dropna(axis = 1, thresh=2) #O corte irá acontecer nas colunas que tiverem dois ou mais nan -> thresh = 2 -> limite >= 2

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [63]:
df_1.fillna(0) # preenche os dados nan com 0 -> fillna(0) -> poderia ser qualquer coisa no lugar do 0, até uma string 'conteúdo'

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [64]:
df_1['A'].sum() #Vai somar os valores da coluna A
df_1['A']. mean() #Média dos valores da coluna A

np.float64(1.5)

In [65]:
df_1['A'].fillna(value=df_1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [66]:
df_1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df_1.ffill() #Preenche os nan com o último valor acima
#df_1.bfill() vai preencher com os valores de baixo

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

###Groupby

In [68]:
data = {
    'Classe': ['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
    'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
    'Venda': [200,120,340,124,243,350]
}

In [69]:
df_2 = pd.DataFrame(data)
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [70]:
group = df_2.groupby('Classe')

In [71]:
group.sum()

                   Nome  Venda
Classe
Júnior      JorgeCarlos    320
Pleno   RobertaPatrícia    464
Sênior        BrunoVera    593

In [72]:
group_2 = df_2.groupby("Classe").min() #Quem vendeu menos
group_2

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [73]:
group_2 = df_2.groupby('Classe').max()
group_2

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [74]:
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [75]:
df_3 = df_2.copy()

In [76]:
df_3['Venda'] = [150,432,190,230,410,155]

In [77]:
df_3

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [78]:
df_2

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [79]:
df_4 = pd.concat([df_2,df_3])
df_4

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [80]:
group_3 = df_4.groupby(['Classe', 'Nome']).sum()
group_3

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505

###Merge, concat e join

In [83]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

In [84]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                            'B': ['B4', 'B5', 'B6', 'B7'],
                            'C': ['C4', 'C5', 'C6', 'C7'],
                            'D': ['D4', 'D5', 'D6', 'D7']},
                            index=[4, 5, 6, 7])

In [85]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                    index=[8, 9, 10, 11])

In [86]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [87]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [88]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [89]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [90]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [92]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                            'A': ['A0', 'A1', 'A2', 'A3'],
                            'B': ['B0', 'B1', 'B2', 'B3']})

In [93]:
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [94]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [95]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [97]:
pd.merge(esquerda, direita, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [100]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                        'key2': ['K0', 'K1', 'K0', 'K1'],
                            'A': ['A0', 'A1', 'A2', 'A3'],
                            'B': ['B0', 'B1', 'B2', 'B3']})

In [101]:
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                                'key2': ['K0', 'K0', 'K0', 'K0'],
                                    'C': ['C0', 'C1', 'C2', 'C3'],
                                    'D': ['D0', 'D1', 'D2', 'D3']})

In [102]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [103]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [105]:
pd.merge(esquerda, direita, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [106]:
pd.merge(esquerda, direita, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [108]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']},
                        index=['K0', 'K1', 'K2'])

In [109]:
direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                        'D': ['D0', 'D2', 'D3']},
                        index=['K0', 'K2', 'K3'])

In [110]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [111]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

###Operações com DataFrame